### **Práctica 1 de Notebook**
Esta práctica tiene por objetivo introducirnos en la herramienta Colaboratoy y en la programación Python.
También vamos a introducir algunas librerías desarrolladas en Python especiales para el análisis de datos. De manera específica, Pandas.
---

In [ ]:
import pandas as pd
import numpy as np
import psutil, os

In [ ]:
#Voy a definir una función para obtener información de la memoria
#de tal manera que pueda medir cuanta memoria podría usar un determinado proceso
def huella_memoria():
  mem = psutil.Process(os.getpid()).memory_info().rss
  return(mem//1024**2)

In [ ]:
antes = huella_memoria()

In [ ]:
#Voy a crear un arreglo de números aleatorios
x=np.random.rand(100)
x

array([1.99086948e-01, 6.79043900e-05, 2.46877745e-01, 5.05295517e-02,
       7.09434138e-01, 9.75082510e-01, 4.65539948e-01, 9.31132432e-01,
       3.57432549e-01, 2.21727067e-01, 1.78950665e-01, 8.13951729e-01,
       1.35859542e-01, 6.38995338e-01, 4.44699631e-01, 8.54433084e-01,
       2.09285342e-01, 5.20188483e-01, 1.48347778e-01, 1.87030524e-01,
       1.12212222e-01, 7.27842687e-01, 2.53968192e-01, 9.92784348e-01,
       5.29495682e-01, 5.28521530e-01, 9.23146782e-01, 5.07031049e-01,
       6.13924366e-01, 3.44660163e-02, 3.80680693e-01, 5.22398898e-01,
       4.49346456e-02, 3.63749413e-01, 8.44421965e-01, 1.23003280e-01,
       4.85675568e-01, 6.96243892e-01, 1.21057087e-01, 8.53522086e-01,
       3.50755141e-01, 6.16242720e-01, 9.67153021e-01, 2.79838470e-01,
       3.36343750e-02, 8.75332843e-01, 8.07676483e-01, 6.34760482e-01,
       8.91187860e-01, 7.83872884e-01, 1.79587167e-01, 1.10992637e-01,
       8.45756802e-01, 6.35795699e-01, 1.24110814e-01, 4.69993412e-02,
       4.57535468e-01, 1.64712385e-02, 2.27904679e-01, 7.35634383e-01,
       1.99610750e-01, 6.25451841e-02, 9.54533957e-01, 2.00937868e-02,
       5.18104482e-01, 2.73568833e-01, 7.64418666e-01, 2.55899756e-01,
       5.71685434e-01, 6.68354522e-01, 7.71814586e-02, 8.99522666e-01,
       5.15429892e-01, 9.48061647e-01, 6.08031432e-01, 6.91848415e-01,
       5.89137242e-01, 4.81797884e-01, 3.67241036e-01, 1.50656706e-01,
       1.82536680e-01, 5.18371450e-01, 8.56175669e-01, 2.98599956e-01,
       9.97936894e-02, 3.08194849e-01, 5.92240052e-01, 5.37137247e-01,
       8.06384230e-02, 1.14478567e-01, 5.10705001e-02, 2.13733867e-01,
       2.65799980e-01, 1.66607901e-03, 5.80211826e-01, 7.96245736e-01,
       2.04952077e-01, 6.80709269e-01, 2.65977730e-01, 3.00621505e-01])

In [ ]:
despues = huella_memoria()

In [ ]:
ahora = despues - antes
ahora

0

In [ ]:
#Voy a crear un Dataframe.
df = pd.DataFrame(x)
df

           0
0   0.199087
1   0.000068
2   0.246878
3   0.050530
4   0.709434
..       ...
95  0.796246
96  0.204952
97  0.680709
98  0.265978
99  0.300622

[100 rows x 1 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       100 non-null    float64
dtypes: float64(1)
memory usage: 928.0 bytes

In [ ]:
url = "https://raw.githubusercontent.com/joanby/python-ml-course/master/datasets/titanic/titanic3.csv"

In [ ]:
df = pd.read_csv(url)
df.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [ ]:
df.tail()

      pclass  survived                       name  ... boat   body  home.dest
1304       3         0       Zabour, Miss. Hileni  ...  NaN  328.0        NaN
1305       3         0      Zabour, Miss. Thamine  ...  NaN    NaN        NaN
1306       3         0  Zakarian, Mr. Mapriededer  ...  NaN  304.0        NaN
1307       3         0        Zakarian, Mr. Ortin  ...  NaN    NaN        NaN
1308       3         0         Zimmerman, Mr. Leo  ...  NaN    NaN        NaN

[5 rows x 14 columns]

In [ ]:
df.shape

(1309, 14)

In [ ]:
#Para ver los tipos de datos que tienen cada una de las columnas se usa:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [ ]:
df2= pd.read_csv(url)
df2.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [ ]:
df2.fillna(0)

      pclass  survived  ...   body                        home.dest
0          1         1  ...    0.0                     St Louis, MO
1          1         1  ...    0.0  Montreal, PQ / Chesterville, ON
2          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                                0
1305       3         0  ...    0.0                                0
1306       3         0  ...  304.0                                0
1307       3         0  ...    0.0                                0
1308       3         0  ...    0.0                                0

[1309 rows x 14 columns]

In [ ]:
#Para llenar con los promedios de las edades de los pasajeros del Titanic
df2["age"].fillna(df2["age"].mean())

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64

Variables Dummy

In [ ]:
df2["sex"]

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object

In [ ]:
dummy_sexo = pd.get_dummies(df2["sex"], prefix = "sex")

In [ ]:
dummy_sexo

      sex_female  sex_male
0              1         0
1              0         1
2              1         0
3              0         1
4              1         0
...          ...       ...
1304           1         0
1305           1         0
1306           0         1
1307           0         1
1308           0         1

[1309 rows x 2 columns]

In [ ]:
df2 = df2.drop(["sex"], axis=1)

In [ ]:
df2.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 13 columns]

In [ ]:
df2=pd.concat([df2,dummy_sexo], axis=1)

In [ ]:
df2.head()

   pclass  survived  ... sex_female  sex_male
0       1         1  ...          1         0
1       1         1  ...          0         1
2       1         0  ...          1         0
3       1         0  ...          0         1
4       1         0  ...          1         0

[5 rows x 15 columns]

In [ ]:
df2.tail()

      pclass  survived  ... sex_female  sex_male
1304       3         0  ...          1         0
1305       3         0  ...          1         0
1306       3         0  ...          0         1
1307       3         0  ...          0         1
1308       3         0  ...          0         1

[5 rows x 15 columns]

###Graficas

En esta clase vamos a ver como se grafican algunos datos de un Dataframe

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
% matplotlib inline

In [ ]:
df.plot(kind='scatter',x='sex',y='age')

In [ ]:
df.plot(kind='scatter',x='age',y='fare')

In [ ]:
df.plot(kind='hist',x='age',y='fare')

###Ejemplo de Regresión lineal

y = mx + c

y = 4 + 0.8 * x + e

y = alpha + beta * x + c

In [ ]:
x=2.5+0.5*np.random.rand(100)

In [ ]:
x

In [ ]:
e=0+0.5*np.random.rand(100)

In [ ]:
e

In [ ]:
y_pred = 4 + 0.8 * x

In [ ]:
y_actual = 4 + 0.8 * x + e

In [ ]:
y_pred

In [ ]:
x_list=x.tolist()
y_pred_list=y_pred.tolist()
y_actual_list=y_actual.tolist()

In [ ]:
df=pd.DataFrame(
    {
        'x':x_list,
        'y_actual':y_actual_list,
        'y_pred':y_pred_list
    }
)

In [ ]:
df.head()

#Cómputo distribuido

In [ ]:
import numpy as np

In [ ]:
a = np.random.rand(10000)

In [ ]:
a

In [ ]:
a.nbytes

In [ ]:
a.sum()

In [ ]:
%time a.sum()

#Agregación

Agregación es una operación que permite agregar o sumar elementos a una matriz o un dataframe.

* Librería Dask
* Librería Spark

In [ ]:
import dask.array as da

In [ ]:
a_dask = da.from_array(a,chunks=len(a)//4)

In [ ]:
type(a_dask)

In [ ]:
a_dask.chunks

In [ ]:
%%time
num_chunks=4
chunks_tam=len(a)//num_chunks
res=0

In [ ]:
%%time
  for k in range(num_chunks):
    offset=k*chunks_tam
    a_chunk=a[offset:offset+chunks_tam]
    res+=a_chunk.sum()

In [ ]:
res

In [ ]:
%time result_a_dask=a_dask.sum()

In [ ]:
#Introducción Compute
%time result_a_dask.compute()

In [ ]:
result_a_dask.visualize(rankdir='LR')